tap "homebrew/bundle"
tap "homebrew/services"


# Shell and command line

brew "fish"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "starship" # Shell prompt
brew "fzf"      # Fuzzy finder
brew "ripgrep"  # Fast grep
brew "eza"      # `ls` replacement
brew "fd"       # `find` replacement
brew "zoxide"   # `cd` replacement


# Programming tools

brew "asdf" # Language version manager
brew "git"
brew "lazygit"
brew "neovim"

brew "lua-language-server"
brew "ruby-lsp"
brew "biome"    # JS linter
brew "stylua"   # Lua linter

brew "heroku/brew/heroku"
cask "chromedriver"


# Services

brew "kanata"   # Keyboard remapper
brew "postgresql@14", restart_service: true


# Desktop apps

cask "raycast"
cask "wezterm"
cask "betterdisplay"
